//
// Created by 손민균 on 26. 10. 5.
//

/*
 * 한 번의 전환으로 동기화 할 수 있는 색의 경계는 최대 2곳이다.
 * 전환 구역 내부나 전환 구역 외부 안의 경계면은 경계 관계가 유지되고 오직 전환 구역과 남은 구역의 경계에서만 경계의 사라짐을 만들 수 있기 때문이다.
 * 따라서 아무리 최선의 전환 방식을 쓰더라도 전환경계개수 / 2 + 전환경계개수 % 2 가 최소한의 전환을 발생시켜야 하는 횟수이다.
 * 근데 모든 배열에 대하여 위의 최소 전환을 할 수 있는 방법이 존재한다.
 * 그 방법은 전환 경계가 홀수인 경우(양끝이 동일 값인 경우 ex: 1000110001)에는 값이 통일된 양끝 구역을 제외한 나머지 구역을 연속 구역으로 하여 뒤집는 방식이고
 * 1000110001 -> 1111001111 -> 1111111111
 * 그 방법은 전환 경계가 짝수인 경우(양끝이 동일 값인 경우 ex: 10001100010)에는 한쪽 끝 구역을 뒤집어 전환 구역을 없앤 이후에
 * 홀수에서의 방법을 그대로 쓰는 것이다.
 * 10001100010 -> 10001100011 -> 11110011111 -> 11111111111
 * 전환경계개수 / 2 + 전환경계개수 % 2 = 구역의 수 / 2 이므로 코드는 다음과 같이 작성된다.
 */
#include <iostream>
using namespace std;

int main () {
    ios_base::sync_with_stdio (false);
    cin.tie (nullptr);
    cout.tie (nullptr);

    string s;
    cin >> s;

    char c = s[0];
    int convert = 1;
    for (int i = 1; i < s.length(); i++) {
        if (c != s[i]) {
            c = s[i];
            convert++;
        }
    }
    cout << convert / 2 << endl;

    return 0;
}